#include "stdafx.h"
#include "mainGame.h"

//=============================================================
//	## 초기화 ## Init(void)
//=============================================================
HRESULT mainGame::Init(void)
{
	gameNode::Init(TRUE);

	A = 'a';
	jgh = 1;
	
	ssw = true;
	speed = 0.123f;
	hoon = 10;

	return S_OK;
}

//=============================================================
//	## 해제 ## Release(void)
//=============================================================
void mainGame::Release(void)
{
	gameNode::Release();
	//이미지 클래스 나갈때까진 사용할 일 없다.
	//Init함수에서 동적할당 new를 사용했다면 이곳에서 delete 사용한다.


}

//=============================================================
//	## 업데이트 ## Update(void)
//=============================================================
void mainGame::Update(void)
{
	gameNode::Update();
	//이곳에서 계산식, 키보드, 마우스등등 업데이트를 한다.
	//간단하게 이곳에서 코딩한다고 생각하면 된다.

	
}

//=============================================================
//	## 렌더 ## Render(void)
//=============================================================
void mainGame::Render(void)
{
	//흰색 빈 비트맵 (이것도 렌더에 그냥 둘것!!)
	PatBlt(GetMemDC(), 0, 0, WINSIZEX, WINSIZEY, WHITENESS);
//=============================================================



//=============================================================
//백버퍼의 내용을 HDC에 그린다. (이것도 렌더에 그냥 둘것!!)
	this->GetBackBuffer()->Render(GetHDC());
}
